-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- Servidor: mydb
-- Tiempo de generación: 31-01-2021 a las 18:08:10
-- Versión del servidor: 8.0.23
-- Versión de PHP: 7.4.14

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de datos: `euskalmet`
--

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `markers`
--

CREATE TABLE `markers` (
  `id` bigint UNSIGNED NOT NULL,
  `code` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `municipality` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `province` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `altitude` int NOT NULL,
  `x` double(8,2) NOT NULL,
  `y` double(8,2) NOT NULL,
  `station_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `dt` datetime DEFAULT NULL,
  `mean_speed` double(8,2) DEFAULT NULL,
  `mean_direction` double(8,2) DEFAULT NULL,
  `max_speed` double(8,2) DEFAULT NULL,
  `speed_sigma` double(8,2) DEFAULT NULL,
  `direction_sigma` double(8,2) DEFAULT NULL,
  `irradiance` double(8,2) DEFAULT NULL,
  `humidity` double(8,2) DEFAULT NULL,
  `temperature` double(8,2) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Volcado de datos para la tabla `markers`
--

INSERT INTO `markers` (`id`, `code`, `name`, `municipality`, `province`, `altitude`, `x`, `y`, `station_type`, `dt`, `mean_speed`, `mean_direction`, `max_speed`, `speed_sigma`, `direction_sigma`, `irradiance`, `humidity`, `temperature`, `created_at`, `updated_at`) VALUES
(1, 'C00A', 'Kanpezu', 'Campezo/Kanpezu', 'Álava', 550, -2.34, 42.68, 'METEOROLOGICAL', '2021-01-31 12:10:00', 19.19, 261.00, 30.71, 3.64, 10.85, 180.20, 86.60, 8.19, '2021-01-30 16:45:08', '2021-01-31 11:19:38'),
(2, 'C007', 'Santa Clara', 'Donostia / San Sebastián', 'Gipuzkoa', 48, -2.00, 43.32, 'METEOROLOGICAL', '2021-01-31 12:10:00', 24.01, 191.00, 34.56, 3.53, 12.00, 96.30, 87.70, 10.10, '2021-01-30 16:45:08', '2021-01-31 11:19:38'),
(3, 'C003', 'Derio', 'Derio', 'Bizkaia', 30, -2.87, 43.29, 'METEOROLOGICAL', '2021-01-31 12:10:00', 2.95, 144.80, 10.58, 2.20, 26.23, 1.00, 89.30, 10.03, '2021-01-30 16:45:08', '2021-01-31 11:19:38'),
(4, 'C002', 'Arteaga', 'Gautegiz Arteaga', 'Bizkaia', 19, -2.66, 43.35, 'METEOROLOGICAL', '2021-01-31 12:10:00', 10.37, 125.60, 19.40, 3.17, 1.61, 213.90, 92.70, 10.34, '2021-01-30 16:45:08', '2021-01-31 11:19:38'),
(5, 'C001', 'Arkaute I', 'Vitoria-Gasteiz', 'Álava', 517, -2.63, 42.85, 'METEOROLOGICAL', '2021-01-30 17:56:46', 2.00, 189.00, 0.00, 1.00, 7.00, 0.00, 84.00, 20.00, '2021-01-30 16:45:08', '2021-01-30 16:45:08'),
(6, 'C019', 'Matxitxako', 'Bermeo', 'Bizkaia', 433, -2.76, 43.44, 'METEOROLOGICAL', '2021-01-31 12:10:00', 47.70, 229.80, 62.10, 5.62, 7.77, 119.90, 98.90, 8.57, '2021-01-30 16:45:08', '2021-01-31 11:19:38'),
(7, 'C018', 'Higer', 'Hondarribia', 'Gipuzkoa', 43, -1.80, 43.39, 'METEOROLOGICAL', '2021-01-31 12:10:00', 6.08, 259.10, 11.63, 2.27, 26.62, 126.80, 92.00, 11.71, '2021-01-30 16:45:08', '2021-01-31 11:19:38'),
(8, 'C017', 'Miramon', 'Donostia / San Sebastián', 'Gipuzkoa', 113, -1.97, 43.29, 'METEOROLOGICAL', '2021-01-31 12:10:00', 12.20, 182.90, 29.27, 5.29, 23.12, 91.80, 99.70, 9.95, '2021-01-30 16:45:08', '2021-01-31 11:19:38'),
(9, 'C016', 'Arkauti', 'Vitoria-Gasteiz', 'Álava', 526, -2.62, 42.85, 'METEOROLOGICAL', '2021-01-31 12:10:00', 7.99, 248.60, 22.93, 3.71, 21.09, 152.40, 83.60, 8.40, '2021-01-30 16:45:08', '2021-01-31 11:19:38'),
(10, 'C029', 'Zizurkil', 'Zizurkil', 'Gipuzkoa', 149, -2.06, 43.19, 'METEOROLOGICAL', '2021-01-31 12:10:00', 24.16, 185.30, 43.38, 6.12, 16.67, 43.36, 87.10, 9.68, '2021-01-30 16:45:08', '2021-01-31 11:19:39'),
(11, 'C028', 'Zegama', 'Zegama', 'Gipuzkoa', 520, -2.30, 42.96, 'METEOROLOGICAL', '2021-01-31 12:10:00', 21.82, 250.30, 46.58, 7.88, 28.20, 2.00, 80.30, 8.60, '2021-01-30 16:45:08', '2021-01-31 11:19:39'),
(12, 'C027', 'Llodio', 'Laudio/Llodio', 'Álava', 207, -2.95, 43.14, 'METEOROLOGICAL', '2021-01-30 17:56:46', 2.00, 229.00, 2.00, 1.00, 22.00, 2.00, 90.00, 25.00, '2021-01-30 16:45:08', '2021-01-30 16:45:08'),
(13, 'C026', 'Berastegi', 'Berastegi', 'Gipuzkoa', 379, -1.98, 43.12, 'METEOROLOGICAL', '2021-01-31 12:10:00', 3.35, 337.90, 8.10, 1.62, 25.23, 1.00, 93.50, 8.22, '2021-01-30 16:45:08', '2021-01-31 11:19:39'),
(14, 'C025', 'Beluntza', 'Urkabustaiz', 'Álava', 687, -2.89, 42.96, 'METEOROLOGICAL', '2021-01-31 12:10:00', 13.18, 222.60, 28.58, 4.90, 12.77, 2.00, 100.00, 6.67, '2021-01-30 16:45:08', '2021-01-31 11:19:39'),
(15, 'C024', 'Iturrieta', 'Agurain/Salvatierra', 'Álava', 987, -2.35, 42.80, 'METEOROLOGICAL', '2021-01-31 12:10:00', 21.28, 256.60, 29.99, 2.81, 6.91, 2.00, 98.60, 4.94, '2021-01-30 16:45:08', '2021-01-31 11:19:39'),
(16, 'C023', 'Arrasate', 'Arrasate/Mondragón', 'Gipuzkoa', 318, -2.49, 43.07, 'METEOROLOGICAL', '2021-01-31 12:10:00', 14.98, 137.90, 31.03, 6.77, 21.02, 120.90, 91.20, 8.32, '2021-01-30 16:45:08', '2021-01-31 11:19:39'),
(17, 'C022', 'Urkiola', 'Abadiño', 'Bizkaia', 709, -2.65, 43.10, 'METEOROLOGICAL', '2021-01-31 12:10:00', 15.44, 209.00, 27.18, 4.28, 13.62, 110.40, 101.00, 5.12, '2021-01-30 16:45:08', '2021-01-31 11:19:39'),
(18, 'C021', 'Roitegi', 'Arraia-Maeztu', 'Álava', 980, -2.37, 42.78, 'METEOROLOGICAL', '2021-01-31 12:10:00', 25.09, 268.20, 33.52, 3.56, 7.46, 0.00, 102.40, 5.09, '2021-01-30 16:45:08', '2021-01-31 11:19:39'),
(19, 'C020', 'Trebiño', 'Condado de Treviño', 'Burgos', 578, -2.70, 42.72, 'METEOROLOGICAL', '2021-01-31 12:10:00', 14.44, 274.30, 41.29, 7.78, 31.35, 99.60, 87.60, 8.50, '2021-01-30 16:45:08', '2021-01-31 11:19:40'),
(20, 'C0B6', 'Berna', 'Iurreta', 'Bizkaia', 95, -2.67, 43.19, 'METEOROLOGICAL', '2021-01-31 12:10:00', 1.00, 101.00, 2.00, 1.00, 26.00, 1.00, 95.10, 9.72, '2021-01-30 16:45:08', '2021-01-31 11:19:40'),
(21, 'C039', 'Deusto', 'Bilbao', 'Bizkaia', 3, -2.97, 43.28, 'METEOROLOGICAL', '2021-01-31 12:10:00', 20.45, 180.30, 38.45, 7.31, 18.82, 100.60, 82.00, 10.54, '2021-01-30 16:45:08', '2021-01-31 11:19:40'),
(22, 'C038', 'Galindo', 'Sestao', 'Bizkaia', 5, -3.00, 43.31, 'METEOROLOGICAL', '2021-01-31 12:10:00', 11.20, 181.10, 18.36, 2.84, 18.84, 1.00, 82.40, 11.53, '2021-01-30 16:45:08', '2021-01-31 11:19:40'),
(23, 'C037', 'Venta Alta', 'Arrigorriaga', 'Bizkaia', 162, -2.90, 43.22, 'METEOROLOGICAL', '2021-01-31 12:10:00', 24.48, 208.90, 34.56, 4.43, 12.71, 151.30, 90.10, 9.19, '2021-01-30 16:45:08', '2021-01-31 11:19:40'),
(24, 'C036', 'Iurreta', 'Iurreta', 'Bizkaia', 175, -2.62, 43.18, 'METEOROLOGICAL', '2021-01-31 12:10:00', 6.48, 81.00, 10.94, 2.20, 14.26, 116.80, 95.00, 9.64, '2021-01-30 16:45:08', '2021-01-31 11:19:40'),
(25, 'C035', 'Altube', 'Zuia', 'Álava', 618, -2.87, 42.97, 'METEOROLOGICAL', '2021-01-31 12:10:00', 4.97, 165.30, 16.24, 3.82, 38.86, 122.40, 98.50, 7.40, '2021-01-30 16:45:08', '2021-01-31 11:19:40'),
(26, 'C034', 'Espejo', 'Valdegovía/Gaubea', 'Álava', 504, -3.04, 42.81, 'METEOROLOGICAL', '2021-01-31 12:10:00', 8.46, 43.33, 12.35, 1.15, 15.50, 2.00, 82.30, 8.79, '2021-01-30 16:45:08', '2021-01-31 11:19:40'),
(27, 'C033', 'Igorre', 'Igorre', 'Bizkaia', 150, -2.78, 43.17, 'METEOROLOGICAL', '2021-01-31 12:10:00', 9.04, 212.30, 13.39, 2.34, 12.26, 100.70, 95.60, 9.44, '2021-01-30 16:45:08', '2021-01-31 11:19:41'),
(28, 'C031', 'Moreda', 'Moreda de Álava/Moreda Araba', 'Álava', 490, -2.41, 42.53, 'METEOROLOGICAL', '2021-01-31 12:10:00', 31.03, 297.90, 50.44, 5.00, 9.58, 309.10, 71.05, 11.60, '2021-01-30 16:45:08', '2021-01-31 11:19:41'),
(29, 'C030', 'Salvatierra', 'Agurain/Salvatierra', 'Álava', 589, -2.40, 42.86, 'METEOROLOGICAL', '2021-01-31 12:10:00', 5.69, 11.80, 10.22, 1.58, 13.31, 135.70, 93.60, 6.75, '2021-01-30 16:45:08', '2021-01-31 11:19:41'),
(30, 'C049', 'Subijana', 'Erriberagoitia/Ribera Alta', 'Álava', 537, -2.89, 42.82, 'METEOROLOGICAL', '2021-01-31 12:10:00', 7.09, 244.40, 12.71, 1.58, 12.82, 182.70, 84.60, 8.13, '2021-01-30 16:45:08', '2021-01-31 11:19:41'),
(31, 'C048', 'Herrera', 'Lagrán', 'Álava', 1188, -2.68, 42.60, 'METEOROLOGICAL', '2021-01-31 12:10:00', 49.79, 286.10, 76.57, 8.50, 11.62, 118.40, 99.90, 4.81, '2021-01-30 16:45:08', '2021-01-31 11:19:41'),
(32, 'C047', 'Kapildui', 'Bernedo', 'Álava', 1173, -2.54, 42.77, 'METEOROLOGICAL', '2021-01-31 12:10:00', 46.12, 244.60, 75.13, 9.14, 11.84, 1.00, 100.20, 3.57, '2021-01-30 16:45:08', '2021-01-31 11:19:41'),
(33, 'C046', 'Oiz', 'Munitibar-Arbatzegi Gerrikaitz', 'Bizkaia', 998, -2.60, 43.23, 'METEOROLOGICAL', '2021-01-31 12:10:00', 45.36, 210.40, 56.81, 3.49, 5.05, 2.00, 98.60, 4.09, '2021-01-30 16:45:08', '2021-01-31 11:19:41'),
(34, 'C045', 'La Garbea', 'Balmaseda', 'Bizkaia', 717, -3.19, 43.22, 'METEOROLOGICAL', '2021-01-31 12:10:00', 24.26, 237.80, 32.47, 3.78, 7.12, 1.00, 96.90, 5.08, '2021-01-30 16:45:08', '2021-01-31 11:19:41'),
(35, 'C044', 'Gorbea', 'Zigoitia', 'Álava', 662, -2.74, 43.00, 'METEOROLOGICAL', '2021-01-31 12:10:00', 2.00, 170.00, 3.00, 0.00, 6.00, 2.00, 100.30, 6.67, '2021-01-30 16:45:08', '2021-01-31 11:19:41'),
(36, 'C043', 'Ordizia', 'Ordizia', 'Gipuzkoa', 243, -2.18, 43.05, 'METEOROLOGICAL', '2021-01-31 12:10:00', 3.60, 247.00, 8.82, 1.44, 31.73, 91.10, 95.00, 9.21, '2021-01-30 16:45:08', '2021-01-31 11:19:42'),
(37, 'C042', 'Punta Galea', 'Getxo', 'Bizkaia', 61, -3.04, 43.38, 'METEOROLOGICAL', '2021-01-31 12:10:00', 19.48, 198.70, 33.88, 3.89, 16.16, 87.70, 91.30, 11.27, '2021-01-30 16:45:08', '2021-01-31 11:19:42'),
(38, 'C041', 'Navarrete', 'Bernedo', 'Álava', 689, -2.52, 42.64, 'METEOROLOGICAL', '2021-01-31 12:10:00', 18.14, 289.10, 34.92, 4.93, 17.41, 123.50, 79.71, 8.23, '2021-01-30 16:45:08', '2021-01-31 11:19:42'),
(39, 'C040', 'Gasteiz', 'Vitoria-Gasteiz', 'Álava', 546, -2.69, 42.86, 'METEOROLOGICAL', '2021-01-31 12:10:00', 12.89, 247.50, 30.35, 5.22, 18.87, 118.00, 80.30, 8.03, '2021-01-30 16:45:08', '2021-01-31 11:19:42'),
(40, 'C059', 'Ordunte', 'Valle de Mena', 'Burgos', 300, -3.28, 43.16, 'METEOROLOGICAL', '2021-01-30 17:56:46', 3.00, 173.00, 4.00, 1.00, 27.00, 2.00, 99.00, 20.00, '2021-01-30 16:45:08', '2021-01-30 16:45:08'),
(41, 'C058', 'Bidania', 'Bidania-Goiatz', 'Gipuzkoa', 592, -2.16, 43.15, 'METEOROLOGICAL', '2021-01-31 12:10:00', 3.42, 159.40, 9.54, 2.66, 24.52, 76.03, 94.20, 6.04, '2021-01-30 16:45:08', '2021-01-31 11:19:42'),
(42, 'C053', 'Barazar', 'Zeanuri', 'Bizkaia', 608, -2.71, 43.07, 'METEOROLOGICAL', '2021-01-30 17:56:46', 2.00, 124.00, 2.00, 1.00, 28.00, 2.00, 100.00, 17.00, '2021-01-30 16:45:08', '2021-01-30 16:45:08'),
(43, 'C050', 'Zambrana', 'Berantevilla', 'Álava', 470, -2.89, 42.68, 'METEOROLOGICAL', '2021-01-31 12:10:00', 8.35, 243.70, 14.83, 2.45, 17.67, 123.60, 74.71, 10.27, '2021-01-30 16:45:08', '2021-01-31 11:19:42'),
(44, 'C069', 'Almike (Bermeo)', 'Bermeo', 'Bizkaia', 106, -2.73, 43.41, 'METEOROLOGICAL', '2021-01-31 12:10:00', 14.94, 204.10, 24.34, 3.17, 14.56, 290.30, 100.10, 11.44, '2021-01-30 16:45:08', '2021-01-31 11:19:43'),
(45, 'C068', 'Ilarduia', 'Asparrena', 'Álava', 596, -2.29, 42.87, 'METEOROLOGICAL', '2021-01-31 12:10:00', 15.05, 322.30, 20.81, 1.66, 6.46, 0.00, 36.55, 6.61, '2021-01-30 16:45:08', '2021-01-31 11:19:43'),
(46, 'C066', 'Untzueta', 'Orozko', 'Bizkaia', 764, -2.91, 43.14, 'METEOROLOGICAL', '2021-01-31 12:10:00', 39.60, 207.60, 52.92, 3.71, 7.56, 1.00, 99.30, 5.44, '2021-01-30 16:45:08', '2021-01-31 11:19:43'),
(47, 'C065', 'Cerroja', 'Karrantza Harana/Valle de Carranza', 'Bizkaia', 677, -3.41, 43.21, 'METEOROLOGICAL', '2021-01-31 12:10:00', 15.37, 249.30, 26.82, 4.68, 16.82, 207.10, 101.60, 8.50, '2021-01-30 16:45:08', '2021-01-31 11:19:43'),
(48, 'C064', 'Zarautz', 'Zarautz', 'Gipuzkoa', 80, -2.15, 43.29, 'METEOROLOGICAL', '2021-01-31 12:10:00', 13.82, 177.40, 20.45, 2.41, 11.08, 1.00, 96.30, 10.56, '2021-01-30 16:45:08', '2021-01-31 11:19:43'),
(49, 'C061', 'Arboleda', 'Valle de Trápaga-Trapagaran', 'Bizkaia', 329, -3.07, 43.30, 'METEOROLOGICAL', '2021-01-31 12:10:00', 31.82, 182.80, 49.39, 4.97, 41.08, 2.00, 96.50, 10.54, '2021-01-30 16:45:08', '2021-01-31 11:19:43'),
(50, 'C060', 'Páganos', 'Laguardia', 'Álava', 577, -2.60, 42.56, 'METEOROLOGICAL', '2021-01-31 12:10:00', 31.21, 272.80, 48.35, 6.26, 12.04, 154.40, 84.80, 9.21, '2021-01-30 16:45:08', '2021-01-31 11:19:43'),
(51, 'C075', 'Eitzaga', 'Zaldibar', 'Bizkaia', 270, -2.50, 43.18, 'METEOROLOGICAL', '2021-01-30 17:56:46', 2.00, 120.00, 4.00, 0.00, 14.00, 1.00, 80.00, 12.00, '2021-01-30 16:45:08', '2021-01-30 16:45:08'),
(52, 'C073', 'Mallabia', 'Mallabia', 'Bizkaia', 325, -2.53, 43.19, 'METEOROLOGICAL', '2021-01-31 12:10:00', 8.93, 210.20, 15.16, 2.88, 13.70, 0.00, 95.60, 8.36, '2021-01-30 16:45:08', '2021-01-31 11:19:43'),
(53, 'C072', 'Orduña', 'Urduña/Orduña', 'Bizkaia', 934, -3.04, 42.98, 'METEOROLOGICAL', '2021-01-31 12:10:00', 51.44, 252.40, 57.85, 2.88, 3.47, 1.00, 95.20, 5.40, '2021-01-30 16:45:08', '2021-01-31 11:19:44'),
(54, 'C071', 'Jaizkibel', 'Lezo', 'Gipuzkoa', 545, -1.86, 43.34, 'METEOROLOGICAL', '2021-01-31 12:10:00', 31.03, 214.10, 33.16, 1.19, 3.43, 2.00, 99.90, 7.85, '2021-01-30 16:45:08', '2021-01-31 11:19:44'),
(55, 'C070', 'Zaldiaran', 'Vitoria-Gasteiz', 'Álava', 980, -2.74, 42.80, 'METEOROLOGICAL', '2021-01-31 12:10:00', 43.60, 227.20, 53.64, 2.63, 1.92, 0.00, 105.40, 5.24, '2021-01-30 16:45:08', '2021-01-31 11:19:44');

--
-- Índices para tablas volcadas
--

--
-- Indices de la tabla `markers`
--
ALTER TABLE `markers`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT de las tablas volcadas
--

--
-- AUTO_INCREMENT de la tabla `markers`
--
ALTER TABLE `markers`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=56;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
